trade_exp/src/DataProcessors/ПланировщикПоставокНаСклад/ПланировщикПоставокНаСклад.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПланировщикПоставокНаСклад</name>
  <attributes>
    <name>ПутьКХранилищу</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

trade_exp/src/InformationRegisters/РасписаниеСкладскихПотоков/РасписаниеСкладскихПотоков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="73073e83-36eb-48f7-bb54-afdaa2f25b42">
  <name>РасписаниеСкладскихПотоков</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources extendedConfigurationObject="5747f0e4-2312-4422-a98f-c4af0f694f68">
    <name>НачалоИнтервала</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="0e8eb166-22a0-46b3-9e74-83b058d7ee10">
    <name>ПродолжительностьИнтервала</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes extendedConfigurationObject="67fe8c65-43c4-4c8f-89ca-0a07a1288ed9">
    <name>АвторИзменений</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="d8d80fb8-d205-47c8-a05c-0e5c67256361">
    <name>Поток</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="ac74948d-76ab-4a20-8b5b-effe27d381ba">
    <name>ДатаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="bca00498-5f63-418e-9d0d-89b7008ad9f6">
    <name>НомерИнтервала</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/ГрафикПоставокНаСклад/ГрафикПоставокНаСклад.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="b705356a-3674-4009-9b19-325f4f8d31b5">
  <name>ГрафикПоставокНаСклад</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources extendedConfigurationObject="76b53ffb-1cb8-4f02-8672-d6fb75f950f8">
    <name>Поток</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="7d8d9c96-2e82-42e6-9eaa-77e664a95aa0">
    <name>ДатаВремяРазгрузкиПлан</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="554d2043-23c2-4d8a-8d1f-7673b049aace">
    <name>ПродолжительностьРазгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="26c907b0-a3c4-480d-b8cf-9e1a032a4aea">
    <name>ДатаВремяПриездаФакт</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="b09375dc-860d-4367-bc6f-b6ac98e85b4a">
    <name>КоличествоИспользуется</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes extendedConfigurationObject="2e92b9a3-164e-497a-a5c9-88c89460f830">
    <name>АвторИзменений</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="dcbd2790-7240-447e-8d1d-bbebc3396ef2">
    <name>СогласованоСоСкладом</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4a7ccbc1-15a7-4f8d-a54f-41f83a07c417">
    <name>ТекстПоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <dimensions extendedConfigurationObject="4e117ade-5a52-4e6e-9ee4-f1a871bf22bd">
    <name>ЗаказПоставщику</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="c96af1ba-579e-4dd9-8e21-ed2ba80d3cad">
    <name>Оборудование</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/СостояниеОтгрузкиДокумента/СостояниеОтгрузкиДокумента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="f6e2a290-cbc8-4936-bbb2-90e8d1c0db51">
  <name>СостояниеОтгрузкиДокумента</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources extendedConfigurationObject="dffce7aa-5f60-4a23-8318-5410c67632ff">
    <name>Состояние</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="1cc5b099-9bfb-4b1e-8a24-a86abbfec9a4">
    <name>Ошибка</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="4a9099ca-f5d8-4382-a001-2e51e75cdaa1">
    <name>ОценкаКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="46ae374e-4820-4eae-9365-1ccc6b8c5430">
    <name>Штрихкод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="3d745fd3-8b9f-420d-a661-da3ab7a348d2">
    <name>НомерЗаезда</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <dimensions extendedConfigurationObject="c260e72d-b1f0-4145-ad5d-b7ddd7768010">
    <name>Документ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="f50361ea-5ef2-4f47-b334-48a3a4671d38">
    <name>Филиал</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/ТехническиеРесурсыСкладов/ТехническиеРесурсыСкладов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="459cbc34-daa7-4457-960b-889934bd0867">
  <name>ТехническиеРесурсыСкладов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="e5bd11eb-ff46-43b2-b19d-1abf09757c92">
    <name>ДопустимоеКоличество</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="26a9a065-c0c5-416f-8580-8e7b6fbf61cb">
    <name>Оборудование</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="79aa1ba0-664e-4001-88f2-a98d06189413">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Enums/СостоянияОтгрузкиДокумента/СостоянияОтгрузкиДокумента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="4aae44bd-66b0-4e44-a260-c24e6ec64d86">
  <name>СостоянияОтгрузкиДокумента</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="8e84c8e8-e768-4147-96fc-6d48a0109758">
    <name>ВОчереди</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="819c0e3a-7dc1-4053-bee0-2c94c94a81a1">
    <name>Заехал</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="7cd0e61f-5363-4ced-bdbb-463d617df349">
    <name>Выехал</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="78b7332e-7f20-463b-b919-4c9896d784b6">
    <name>Ошибка</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Catalogs/ПотокиТранспортныхСредствПоставкиНаСклад/ПотокиТранспортныхСредствПоставкиНаСклад.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="735c9797-25e5-44eb-8f8a-1633c6be5ce1">
  <name>ПотокиТранспортныхСредствПоставкиНаСклад</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="3c2491b2-2a6c-4b6c-a71a-05c1ee467c74">
    <name>Секция</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3cc493c5-f400-4b1b-a013-3158d1b54643">
    <name>ПотокАктивный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="1edd5cde-e02e-4d4c-8065-0c671bbd8ff7">
    <name>Секции</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="203168ef-32cb-4993-9d9d-f84699c6dd7a">
      <name>Секция</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

trade_exp/src/DataProcessors/ПланировщикПоставокНаСклад/Forms/Форма/Module.bsl
#Область ЦветоваяИндикацияЗаказов
//цветовая индикация
////поставка не приехала и редактируется
//плановая поставка не редактируется
//	Поставка.ЦветФона = WebЦвета.ЗеленыйЛес;
//плановая поставка редактируется
//	Поставка.ЦветФона = WebЦвета.Голубой;
////поставка приехала и не редактируется
//	заехал
//		Поставка.ЦветФона = WebЦвета.Золотой;
//	выехал
//		Поставка.ЦветФона = WebЦвета.ТусклоОливковый;
//	поставка опоздала
//		Поставка.ЦветФона = WebЦвета.Лосось;
//	поставка прибыла
//		Поставка.ЦветФона = WebЦвета.СветлоКоричневый;
#КонецОбласти

#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//заполнение таблицы цветов
	ЦветаНередактируемыхИнтервалов = Новый Массив;
	ЦветаНередактируемыхИнтервалов.Добавить(WebЦвета.ЗеленыйЛес);
	ЦветаНередактируемыхИнтервалов.Добавить(WebЦвета.Коралловый);
	//Заполнение параметров открытия
	Если Параметры.Период <> '00010101' Тогда
		
		Если Параметры.Секция <> Справочники.РабочиеУчастки.ПустаяСсылка() Тогда
			Секции.Добавить(Параметры.Секция);
			Склад = Параметры.Секция.Владелец;
			Склады.Добавить(Склад);
		КонецЕсли;
		
		Период.ДатаНачала = Параметры.Период;
		Период.ДатаОкончания = КонецДня(Параметры.Период);
		Дата = Параметры.Период;
		
		Если Параметры.ИзФормыЗаказа Тогда
			РежимРедактирования = Истина;
		КонецЕсли;
	Иначе
		Период.ДатаНачала = НачалоДня(ТекущаяДата());
		Период.ДатаОкончания = КонецДня(ТекущаяДата());
	КонецЕсли;
	
	Если Параметры.ЗаказПоставщику <> Документы.ЗаказПоставщику.ПустаяСсылка() Тогда
		ТекущийЗаказ = Параметры.ЗаказПоставщику;
		Элементы.Период.Доступность = Не Параметры.НельзяВыбиратьДату;
	КонецЕсли;
	
 	Если Параметры.ДополнительныеРесурсы.Количество()>0 Тогда 
		СписокТребРесурсов = Параметры.ДополнительныеРесурсы;
		Для каждого СтрРесурс из СписокТребРесурсов Цикл
			СтрТЧ = ДополнительныеРесурсы.Добавить();
			ЗаполнитьЗначенияСвойств(СтрТЧ, СтрРесурс.Значение);
		КонецЦикла;
	КонецЕсли;
	
	ПродолжительностьРазгрузки = Параметры.ПродолжительностьРазгрузки;
	КомментарийКПоставке = Параметры.КомментарийКПоставке;
	//доступность и видимость элементов
	Элементы.Склад.Доступность = Не РежимРедактирования;
	
	Элементы.Секции.Доступность = Не РежимРедактирования;
	Элементы.Подтвердить.Видимость = РежимРедактирования;
	ИнтервалВыбран = Не РежимРедактирования;
	
	Элементы.Склад.Видимость = РежимРедактирования;
	Элементы.Склады.Видимость = Не РежимРедактирования;
	Элементы.Период.Видимость = РежимРедактирования;
	Элементы.Период1.Видимость = Не РежимРедактирования;
	Склады.Добавить(Склад);
	Если Параметры.Период <> '00010101' И Склады.Количество() > 0 Тогда
		ЗаполнитьПланировщик();
	КонецЕсли;
	//видимость команды согласования
	Если РольДоступна("СогласованиеВремениПоставки") ИЛИ РольДоступна("ПолныеПрава") Тогда
		Элементы.ПланировщикКонтекстноеМенюСогласоватьСоСкладом.Видимость = Истина;
		Элементы.ПланировщикКонтекстноеМенюСогласоватьСоСкладом1.Видимость = Истина;
	Иначе
		Элементы.ПланировщикКонтекстноеМенюСогласоватьСоСкладом.Видимость = Ложь;
		Элементы.ПланировщикКонтекстноеМенюСогласоватьСоСкладом1.Видимость = Ложь;
	КонецЕсли;
	
	//видимость настройки округления
	Элементы.АвтокоррекцияИнтервала.Видимость = РежимРедактирования;   
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если Модифицированность Тогда
		Ответ = Неопределено;
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗавершитьРедактированиеГрафика", ЭтотОбъект), "Вы точно хотите выйти без сохранения изменений?",
		 РежимДиалогаВопрос.ДаНет);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
КонецПроцедуры 

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	Если РежимРедактирования Тогда
		Секции.Очистить();
		Если Параметры.Секция<> Справочники.РабочиеУчастки.ПустаяСсылка() Тогда
			Секции.Добавить(Параметры.Секция);
		Иначе
			ЗаполнитьСписокСекцийСервер();
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(Дата) И Дата <> Период.ДатаНачала Тогда
			Период.ДатаНачала = Дата;
			Период.ДатаОкончания = КонецДня(Дата);
		КонецЕсли;      
		ЗаказЕстьВСетке = Ложь;
		ЗаполнитьПланировщик();
	Иначе
		Если Период.ДатаНачала <> '00010101' И Склады.Количество() > 0 Тогда
			ЗаполнитьПланировщик();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


#КонецОбласти

#Область Команды

&НаКлиенте
Процедура ОбновитьКалендарь(Команда)
	ЗаказЕстьВСетке = Ложь;
	ЗаполнитьПланировщик();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДокумент(Команда)
	Если Элементы.Планировщик.Видимость Тогда
		ВыделенныеЭлементы = Элементы.Планировщик.ВыделенныеЭлементы; 
	Иначе
		ВыделенныеЭлементы = Элементы.ОтчетПоПоставкам.ВыделенныеЭлементы;
	КонецЕсли;
	Если  ВыделенныеЭлементы.Количество()>0 Тогда
		СсылкаНаДокумент = ВыделенныеЭлементы[0].Значение;
		ПараметрыФормы = Новый Структура("Ключ", СсылкаНаДокумент);
		ОткрытьФорму("Документ.ЗаказПоставщику.ФормаОбъекта", ПараметрыФормы);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Подтвердить(Команда)
	Если Модифицированность Тогда
		Модифицированность = Ложь; 
		ЗаписатьИзмененияПланировщикаСервер();
		Элементы.Подтвердить.Видимость = Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущийЗаказ) Тогда
		ЭтаФорма.Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНовуюФорму(Команда)
	ОткрытьФорму("Обработка.ПланировщикПоставокНаСклад.Форма.Форма",,, Новый УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура СогласоватьСоСкладом(Команда)
	Если Элементы.Планировщик.Видимость Тогда
		ВыбранныйИнтервалЗаказа = Элементы.Планировщик.ВыделенныеЭлементы[0];
	Иначе
		ВыбранныйИнтервалЗаказа = Элементы.ОтчетПоПоставкам.ВыделенныеЭлементы[0];
	КонецЕсли;
	ВыбранныйИнтервалЗаказа.ЦветРамки = WebЦвета.Белый;
	ЗначениеСогласованияСоСкладом = Истина;
	ВремяНачалаПоставки = ВыбранныйИнтервалЗаказа.Начало;
	ВыбранныйПоток = ВыбранныйИнтервалЗаказа.ЗначенияИзмерений["Потоки"];
	//внести данные для записи
	ДобавитьЗаказВИзмененные(ВыбранныйИнтервалЗаказа, Истина);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

&НаКлиенте
Процедура ПланировщикПриСменеТекущегоПериодаОтображения(Элемент, ТекущиеПериодыОтображения, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикВыбор(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;	
	ОткрытьДокумент(Команды.ОткрытьДокумент);	
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикПередНачаломРедактирования(Элемент, НовыйЭлемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДобавленныйЭлемент = Элемент.ВыделенныеЭлементы[0];
	Если ДобавленныйЭлемент <> Неопределено Тогда
		ЗаполнитьПланировщик();
	КонецЕсли;
	Комментарий = ПолучитьКомментарийПоставки(ДобавленныйЭлемент.Значение);
	ДобавленныйЭлемент.Текст = Комментарий;
	РедактировалсяКомментарий = Истина;
	ПараметрыОткрытияФормыПодбора = Новый Структура;
	ПараметрыОткрытияФормыПодбора.Вставить("Комментарий", Комментарий);
	ЗаказСРедактированнымКомментарием = ДобавленныйЭлемент.Значение;
	
	ОткрытьФорму("Обработка.ПланировщикПоставокНаСклад.Форма.ФормаРедактированиеКомментария", ПараметрыОткрытияФормыПодбора, ЭтаФорма,,,,Новый ОписаниеОповещения("ОбновитьКомментарий", ЭтотОбъект));
	ОчиститьСообщения();
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикПриОкончанииРедактирования(Элемент, НовыйЭлемент, ОтменаРедактирования)
	ДобавленныйЭлемент = Элемент.ВыделенныеЭлементы[0];
	Если не РедактировалсяКомментарий Тогда
		//убираем секунды
		ДобавленныйЭлемент.Начало = НачалоДня(ДобавленныйЭлемент.Начало) + Час(ДобавленныйЭлемент.Начало)*3600 + Минута(ДобавленныйЭлемент.Начало)*60;
		ДобавленныйЭлемент.Конец = НачалоДня(ДобавленныйЭлемент.Конец) + Час(ДобавленныйЭлемент.Конец)*3600 + Минута(ДобавленныйЭлемент.Конец)*60;  
		
		Если АвтокоррекцияИнтервала Тогда
			//"подвигаем" начало поставки до "ближайшей пятерки"
			//1-4 -> 5; 6-9 -> 0
			МинутыНачала = Строка(Минута(ДобавленныйЭлемент.Начало));
			МинутыНачала = ?(СтрДлина(МинутыНачала)=1, "0"+МинутыНачала, МинутыНачала);
			ПоследняяЦифраМинуты = Число(Прав(МинутыНачала, 1));
			Если ПоследняяЦифраМинуты < 5 Тогда
				МинутСдвинуто = Число(Лев(МинутыНачала,1) + "5");
			КонецЕсли;
			Если ПоследняяЦифраМинуты > 5 Тогда
				ДесяткаМинут = Строка(Число(Лев(МинутыНачала,1))+1); 
				МинутСдвинуто = Число(ДесяткаМинут + "0");
			КонецЕсли;
			Если ПоследняяЦифраМинуты <> 5 и ПоследняяЦифраМинуты <> 0 Тогда
				ДобавленныйЭлемент.Начало = НачалоДня(ДобавленныйЭлемент.Начало) + Час(ДобавленныйЭлемент.Начало)*3600 + МинутСдвинуто*60;
				ДобавленныйЭлемент.Конец = ДобавленныйЭлемент.Начало + ПродолжительностьРазгрузки*60; 
			КонецЕсли;
		КонецЕсли;
		Если Не РежимРедактирования Тогда
			ОтменаРедактирования = Истина;
		Иначе
			Если НовыйЭлемент ИЛИ ДобавленныйЭлемент.Значение=ТекущийЗаказ Тогда
				Если НЕ ОтменаРедактирования И РежимРедактирования Тогда
					ДругиеЗаказы = Планировщик.Элементы;
					ОтборПоПотоку = Новый Структура;
					Для каждого Интервал из ДругиеЗаказы Цикл
						Если ДобавленныйЭлемент.ЗначенияИзмерений["Потоки"] = Интервал.ЗначенияИзмерений["Потоки"] И ДобавленныйЭлемент.ЦветФона <> Интервал.ЦветФона Тогда
							Если НовыйЭлемент Тогда
								ДобавленныйЭлемент.Конец = ДобавленныйЭлемент.Начало+ПродолжительностьРазгрузки*60;
							КонецЕсли;
							Если ПроверкиАльтерраСервер.ИнтервалПопалВПромежуток(ДобавленныйЭлемент.Начало, ДобавленныйЭлемент.Конец, Интервал.Начало, Интервал.Конец) ИЛИ ПроверкиАльтерраСервер.ИнтервалПопалВПромежуток(Интервал.Начало, Интервал.Конец, ДобавленныйЭлемент.Начало, ДобавленныйЭлемент.Конец)Тогда
								ОтменаРедактирования = Истина;
								Сообщить("Интервал не может перекрывать уже существующие!");
								Прервать;
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				
				Если НЕ ОтменаРедактирования И РежимРедактирования Тогда
					//условие на остаток доступный
					ФиксированноеСоответствие = ДобавленныйЭлемент.ЗначенияИзмерений;
					НачалоИнтервала = Неопределено;
					КонецИнтервала = Неопределено;
					ОборудованияХватает = Истина;
					Для каждого ИнтервалФона из Планировщик.ИнтервалыФона Цикл
						Если ИнтервалФона.ЗначенияИзмерений["Потоки"] = ФиксированноеСоответствие["Потоки"] Тогда
							Если НачалоИнтервала = Неопределено Тогда
								НачалоИнтервала = ИнтервалФона.Конец;
							ИначеЕсли КонецИнтервала= Неопределено Тогда
								КонецИнтервала = ИнтервалФона.Начало;
								ОборудованияХватает = ЕстьЛиДоступноеОборудование(НачалоИнтервала, КонецИнтервала, ДобавленныйЭлемент.Значение, ДобавленныйЭлемент.Начало, ДобавленныйЭлемент.Конец);
								НачалоИнтервала = Неопределено;
								КонецИнтервала = Неопределено;
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;
					
					Если ОборудованияХватает Тогда
						ВремяНачалаПоставки = ДобавленныйЭлемент.Начало;
						ВыбранныйПоток = ДобавленныйЭлемент.ЗначенияИзмерений["Потоки"];
						//выравнять конец
						ДобавленныйЭлемент.Конец = ДобавленныйЭлемент.Начало+ПродолжительностьРазгрузки*60;
					Иначе
						Сообщить("Недостаточно технических ресурсов склада!");
						ОтменаРедактирования = Истина;
					КонецЕсли;  
				КонецЕсли;
			КонецЕсли;
			Если ДобавленныйЭлемент.Значение <> ТекущийЗаказ И ЗаказЕстьВСетке Тогда
				ОтменаРедактирования = Истина;
			ИначеЕсли  Не ОтменаРедактирования И ДобавленныйЭлемент.Значение = Неопределено И НЕ ЗаказЕстьВСетке Тогда
				ДобавленныйЭлемент.Значение = ТекущийЗаказ;	
			ИначеЕсли ДобавленныйЭлемент.ЦветФона <> WebЦвета.Голубой Тогда
				Если ДобавленныйЭлемент.Значение = ТекущийЗаказ Тогда
					Сообщить("Вы не можете редактировать время прибывшей поставки!");
				Иначе
					Сообщить("Вы не можете редактировать время чужой поставки!");
				КонецЕсли;
				ОтменаРедактирования = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ ОтменаРедактирования Тогда
			ДобавитьЗаказВИзмененные(ДобавленныйЭлемент);
			Если НовыйВремяНачала <> '00010101' Тогда
				ДобавленныйЭлемент.ЦветФона = WebЦвета.Голубой;
				НовыйВремяНачала = '00010101';
			КонецЕсли;
		КонецЕсли;
	Иначе
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикПередСозданием(Элемент, Начало, Конец, Значения, Текст, СтандартнаяОбработка)
	//проверка на уже созданных и не более стольки-то
	Интервал = Планировщик.Элементы.Найти(ТекущийЗаказ);
	Если ИнтервалВыбран ИЛИ Интервал<>Неопределено И Интервал.Начало > НачалоДня(Интервал.Начало) Тогда
		СтандартнаяОбработка = Ложь;
		ИнтервалВыбран = Истина;
	Иначе
		НовыйВремяНачала = Начало;
		НовыйВремяОкончания = Конец;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикПередУдалением(Элемент, Отказ)
	Если Не Элементы.Период.Доступность Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	ИнтервалВыбран = Ложь;
	ДобавленныйЭлемент = Элемент.ВыделенныеЭлементы[0];
	Если Элемент.ВыделенныеЭлементы[0].ЦветФона <> WebЦвета.Голубой Тогда
		Отказ = Истина;
		Возврат;
	Иначе
		ЗаказЕстьВСетке = Ложь;
	КонецЕсли;

	ДобавитьЗаказВИзмененные(ДобавленныйЭлемент, Истина, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикПриИзменении(Элемент)
	Модифицированность = Истина;
	Элементы.Подтвердить.Видимость = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент) 
	Если Дата < НачалоДня(ТекущаяДата()) Тогда  
		Дата = Период.ДатаНачала;
	Иначе
		Период.ДатаНачала = НачалоДня(Дата);
		Период.ДатаОкончания = КонецДня(Дата);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Период1ПриИзменении(Элемент)
	Если НачалоДня(Период.ДатаНачала) <> НачалоДня(Период.ДатаОкончания) Тогда
		Элементы.ОтчетПоПоставкам.Видимость = Истина;
		Элементы.Планировщик.Видимость = Ложь;
	Иначе
		Элементы.ОтчетПоПоставкам.Видимость = Ложь;
		Элементы.Планировщик.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	Склады.Очистить();
	Склады.Добавить(Склад);
	ЗаполнитьСписокСекцийСервер();
КонецПроцедуры

&НаКлиенте
Процедура СкладыПриИзменении(Элемент)
	ЗаполнитьСписокСекцийСервер();
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикОбработкаФормированияКоманд(Элемент, Параметры, Команды, КомандаПоУмолчанию)
	КомандаПоУмолчанию = Команды[0];
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеФункции

&НаКлиенте
Процедура ЗавершитьРедактированиеГрафика(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Модифицированность = Ложь;
		Закрыть();
	Иначе
		Возврат;
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура ОбновитьКомментарий(Результат, ДополнительныеПараметры)  Экспорт
	Если РежимРедактирования ИЛИ Элементы.Планировщик.Видимость = Истина Тогда
		ТекПланировщик = Планировщик;
	Иначе
		ТекПланировщик = ОтчетПоПоставкам;
	КонецЕсли;
	ДобавленныйЭлемент = ТекПланировщик.Элементы.Найти(ЗаказСРедактированнымКомментарием);
	Если ЗначениеЗаполнено(Результат) И Результат<> КодВозвратаДиалога.Отмена Тогда
		ДобавленныйЭлемент.Текст = ПолучитьПолныйТекстКомментария(ДобавленныйЭлемент.Значение, Результат.Комментарий);
	Иначе 
		ДобавленныйЭлемент.Текст = ПолучитьПолныйТекстКомментария(ДобавленныйЭлемент.Значение);
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура ДобавитьЗаказВИзмененные(ДобавленныйЭлемент, Согласован=Неопределено, ЭтоУдаление=Ложь)
	
	Модифицированность = Истина;
	Элементы.Подтвердить.Видимость = Истина;
	ОтборПоИзмененнымЗаказам = Новый Структура;
	ОтборПоИзмененнымЗаказам.Вставить("ЗаказПоставщику", ДобавленныйЭлемент.Значение);
	НайденныеСтроки = ИзмененныеЗаказы.НайтиСтроки(ОтборПоИзмененнымЗаказам);
	Если НайденныеСтроки.Количество()=0 Тогда
		СтрокаЗаказа = ИзмененныеЗаказы.Добавить();
	Иначе
		СтрокаЗаказа = НайденныеСтроки[0];
	КонецЕсли;
	СтрокаЗаказа.ЗаказПоставщику = ДобавленныйЭлемент.Значение;
	СтрокаЗаказа.Поток = ДобавленныйЭлемент.ЗначенияИзмерений["Потоки"];
	Если ЭтоУдаление Тогда 
		СтрокаЗаказа.ДатаВремяРазгрузкиПлан = НачалоДня(ДобавленныйЭлемент.Начало);
	Иначе
		СтрокаЗаказа.ДатаВремяРазгрузкиПлан = ДобавленныйЭлемент.Начало;
	КонецЕсли;
	
	СтрокаЗаказа.ПродолжительностьРазгрузки = (ДобавленныйЭлемент.Конец - ДобавленныйЭлемент.Начало) /60;
	СтрокаЗаказа.СогласованоСоСкладом = ?(Согласован=Неопределено, ВернутьЗначениеСогласованностиЗаказаНаСкладе(ДобавленныйЭлемент), Согласован);
	Если ЗначениеЗаполнено(ТекущийЗаказ) Тогда
		ЗначениеСогласованияСоСкладом = СтрокаЗаказа.СогласованоСоСкладом;
	КонецЕсли;
	
	Если ЭтоУдаление Тогда
		ЗаказЕстьВСетке = Ложь;
	Иначе
		ЗаказЕстьВСетке = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ВернутьЗначениеСогласованностиЗаказаНаСкладе(ИнтервалЗаказа)
	ЗакрытыеИнтервалы = Планировщик.ИнтервалыФона;
	Для каждого Интервал из ЗакрытыеИнтервалы Цикл
		Если ИнтервалЗаказа.ЗначенияИзмерений["Потоки"] = Интервал.ЗначенияИзмерений["Потоки"] Тогда
			Если ПроверкиАльтерраСервер.ИнтервалПопалВПромежуток(ИнтервалЗаказа.Начало, ИнтервалЗаказа.Конец, Интервал.Начало, Интервал.Конец) ИЛИ ПроверкиАльтерраСервер.ИнтервалПопалВПромежуток(Интервал.Начало, Интервал.Конец, ИнтервалЗаказа.Начало, ИнтервалЗаказа.Конец)Тогда
				ИнтервалЗаказа.ЦветРамки = WebЦвета.Красный;
				Возврат Ложь; 
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	ИнтервалЗаказа.ЦветРамки = WebЦвета.Белый;
	Возврат Истина;
КонецФункции 

&НаСервере
Процедура ЗаполнитьСписокСекцийСервер()
Секции.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РабочиеУчастки.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.РабочиеУчастки КАК РабочиеУчастки
		|ГДЕ
		|	РабочиеУчастки.Владелец В(&Склады)
		|	И РабочиеУчастки.ПометкаУдаления = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	РабочиеУчастки.Владелец.Наименование,
		|	РабочиеУчастки.Наименование";
	Запрос.УстановитьПараметр("Склады", Склады.ВыгрузитьЗначения());
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Секции.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;

КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьПланировщик()
	Если НачалоДня(Период.ДатаНачала) <> НачалоДня(Период.ДатаОкончания) Тогда
		ПланировщикРезультат = ОтчетПоПоставкам;
		Элементы.ОтчетПоПоставкам.Видимость = Истина;
		Элементы.Планировщик.Видимость = Ложь;
	Иначе
		ПланировщикРезультат = Планировщик;
		Элементы.ОтчетПоПоставкам.Видимость = Ложь;
		Элементы.Планировщик.Видимость = Истина;
	КонецЕсли;
	
	//подготовка планировщика
	ДанныеТаблицы = ПланировщикРезультат.Элементы;
	ДанныеТаблицы.Очистить();
	Колонки = ПланировщикРезультат.Измерения;
	Колонки.Очистить();
	КолонкиПотоки = Колонки.Добавить("Потоки");	
	ПланировщикРезультат.ТекущиеПериодыОтображения.Очистить();
	ПланировщикРезультат.ТекущиеПериодыОтображения.Добавить(Период.ДатаНачала, Период.ДатаОкончания);
	
	//подготовить таблицу с днями
	ТекущаяДата = Период.ДатаНачала;
	ТабДатИнтервала = Новый ТаблицаЗначений;
	МассивОписанияТипов= Новый Массив;
	МассивОписанияТипов.Добавить(Тип("Дата"));
	ТабДатИнтервала.Колонки.Добавить("ДеньПериода", Новый ОписаниеТипов(МассивОписанияТипов,,,Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	Пока ТекущаяДата <= НачалоДня(Период.ДатаОкончания) Цикл
		Стр = ТабДатИнтервала.Добавить();
		Стр.ДеньПериода = ТекущаяДата;
		ТекущаяДата = ТекущаяДата + 3600*24;
	КонецЦикла;
	
	//заполнение по расписанию, заглушки на интервалы вне расписания
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
	 "ВЫБРАТЬ РАЗЛИЧНЫЕ
	 |	ПотокиТранспортныхСредствПоставкиНаСкладСекции.Ссылка КАК Поток,
	 |	ПотокиТранспортныхСредствПоставкиНаСкладСекции.Секция.Владелец КАК Склад
	 |ПОМЕСТИТЬ втАктивныеПотоки
	 |ИЗ
	 |	Справочник.ПотокиТранспортныхСредствПоставкиНаСклад.Секции КАК ПотокиТранспортныхСредствПоставкиНаСкладСекции
	 |ГДЕ
	 |	ПотокиТранспортныхСредствПоставкиНаСкладСекции.Секция В(&Секции)
	 |	И ПотокиТранспортныхСредствПоставкиНаСкладСекции.Ссылка.ПотокАктивный = ИСТИНА
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ТабВремя.ДеньПериода КАК ДеньПериода
	 |ПОМЕСТИТЬ втТабДат
	 |ИЗ
	 |	&ТабВремя КАК ТабВремя
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	втАктивныеПотоки.Поток КАК Поток,
	 |	втАктивныеПотоки.Склад КАК Склад,
	 |	втТабДат.ДеньПериода КАК ДеньПериода
	 |ПОМЕСТИТЬ втДатыИПотоки
	 |ИЗ
	 |	втАктивныеПотоки КАК втАктивныеПотоки
	 |		ПОЛНОЕ СОЕДИНЕНИЕ втТабДат КАК втТабДат
	 |		ПО (ИСТИНА)
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ РАЗЛИЧНЫЕ
	 |	ВЫБОР
	 |		КОГДА РасписаниеСкладскихПотоковСрезПоследних.ДатаДоставки ЕСТЬ NULL
	 |			ТОГДА втДатыИПотоки.ДеньПериода
	 |		ИНАЧЕ ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(РасписаниеСкладскихПотоковСрезПоследних.ДатаДоставки, ЧАС, ЧАС(РасписаниеСкладскихПотоковСрезПоследних.НачалоИнтервала)), МИНУТА, МИНУТА(РасписаниеСкладскихПотоковСрезПоследних.НачалоИнтервала))
	 |	КОНЕЦ КАК НачалоИнтервала,
	 |	ВЫБОР
	 |		КОГДА РасписаниеСкладскихПотоковСрезПоследних.ДатаДоставки ЕСТЬ NULL
	 |			ТОГДА втДатыИПотоки.ДеньПериода
	 |		ИНАЧЕ ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(РасписаниеСкладскихПотоковСрезПоследних.ДатаДоставки, ЧАС, ЧАС(РасписаниеСкладскихПотоковСрезПоследних.НачалоИнтервала)), МИНУТА, МИНУТА(РасписаниеСкладскихПотоковСрезПоследних.НачалоИнтервала) + РасписаниеСкладскихПотоковСрезПоследних.ПродолжительностьИнтервала)
	 |	КОНЕЦ КАК КонецИнтервала,
	 |	втДатыИПотоки.Поток КАК Поток,
	 |	втДатыИПотоки.Склад.Наименование КАК СкладНаименование,
	 |	втДатыИПотоки.Поток.Наименование КАК ПотокНаименование
	 |ИЗ
	 |	втДатыИПотоки КАК втДатыИПотоки
	 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РасписаниеСкладскихПотоков.СрезПоследних(, ДатаДоставки МЕЖДУ &НачалоПериода И &КонецПериода) КАК РасписаниеСкладскихПотоковСрезПоследних
	 |		ПО втДатыИПотоки.Поток = РасписаниеСкладскихПотоковСрезПоследних.Поток
	 |			И (втДатыИПотоки.ДеньПериода = НАЧАЛОПЕРИОДА(РасписаниеСкладскихПотоковСрезПоследних.ДатаДоставки, ДЕНЬ))
	 |
	 |УПОРЯДОЧИТЬ ПО
	 |	втДатыИПотоки.Склад.Наименование,
	 |	втДатыИПотоки.Поток.Наименование
	 |ИТОГИ
	 |	МИНИМУМ(НачалоИнтервала)
	 |ПО
	 |	Поток" ;
	Запрос.УстановитьПараметр("Секции", Секции.ВыгрузитьЗначения());
	Запрос.УстановитьПараметр("НачалоПериода", Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", Период.ДатаОкончания);	
	Запрос.УстановитьПараметр("ТабВремя", ТабДатИнтервала);

	Результат = Запрос.Выполнить();
	ВыборкаПоток = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Поток");
	
	ИнтервалыФона = ПланировщикРезультат.ИнтервалыФона;
	ИнтервалыФона.Очистить();
	Пока ВыборкаПоток.Следующий() Цикл
		ВремяНачалаБлокировки = НачалоДня(ВыборкаПоток.НачалоИнтервала);
		//добавляем поток на форму планировщика
		КолонкиПотоки.Элементы.Добавить(ВыборкаПоток.Поток);
		СоответствиеЗначений = Новый Соответствие;
		СоответствиеЗначений.Вставить("Потоки", ВыборкаПоток.Поток);
		//заполняем интервалы потока
		ВыборкаДетально = ВыборкаПоток.Выбрать();
		Пока ВыборкаДетально.Следующий() Цикл
			Если ВремяНачалаБлокировки = ВыборкаДетально.НачалоИнтервала И  ВремяНачалаБлокировки = НачалоДня(ВремяНачалаБлокировки) Тогда
				ВремяОкончанияБлокировки =КонецДня(ВремяНачалаБлокировки);
			Иначе
				ВремяОкончанияБлокировки =ВыборкаДетально.НачалоИнтервала;
			КонецЕсли;
			ЗакраситьИнтервалФона(Новый ФиксированноеСоответствие(СоответствиеЗначений), WebЦвета.СеребристоСерый, ВремяНачалаБлокировки, ВремяОкончанияБлокировки, ИнтервалыФона);
			ВремяНачалаБлокировки = ВыборкаДетально.КонецИнтервала;
		КонецЦикла;
		
		//заглушка на конец дня	
		ЗакраситьИнтервалФона(Новый ФиксированноеСоответствие(СоответствиеЗначений), WebЦвета.СеребристоСерый, ВремяНачалаБлокировки, КонецДня(ВремяНачалаБлокировки), ИнтервалыФона); 
	КонецЦикла;
	
	//заполнение интервалами по заказам с блокировками по оборудованию - блокировки по оборудованию убрали временно
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПотокиТранспортныхСредствПоставкиНаСкладСекции.Ссылка КАК Поток,
	|	ПотокиТранспортныхСредствПоставкиНаСкладСекции.Секция КАК Секция,
	|	ПотокиТранспортныхСредствПоставкиНаСкладСекции.Секция.Владелец КАК Склад
	|ПОМЕСТИТЬ втПотокиТранспортныхСредств
	|ИЗ
	|	Справочник.ПотокиТранспортныхСредствПоставкиНаСклад.Секции КАК ПотокиТранспортныхСредствПоставкиНаСкладСекции
	|ГДЕ
	|	ПотокиТранспортныхСредствПоставкиНаСкладСекции.Ссылка.ПотокАктивный = ИСТИНА
	|	И ПотокиТранспортныхСредствПоставкиНаСкладСекции.Секция В(&Секции)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ГрафикПоставокНаСклад.Период КАК Период,
	|	ГрафикПоставокНаСклад.ЗаказПоставщику КАК ЗаказПоставщику,
	|	втПотокиТранспортныхСредств.Поток КАК Поток,
	|	ГрафикПоставокНаСклад.Оборудование КАК Оборудование,
	|	ГрафикПоставокНаСклад.ДатаВремяРазгрузкиПлан КАК ДатаВремяРазгрузкиПлан,
	|	ГрафикПоставокНаСклад.ПродолжительностьРазгрузки КАК ПродолжительностьРазагрузки,
	|	ГрафикПоставокНаСклад.ДатаВремяПриездаФакт КАК ДатаВремяПриездаФакт,
	|	ЕСТЬNULL(ГрафикПоставокНаСклад.КоличествоИспользуется, 0) КАК КоличествоИспользуется,
	|	ДОБАВИТЬКДАТЕ(ГрафикПоставокНаСклад.ДатаВремяРазгрузкиПлан, МИНУТА, ГрафикПоставокНаСклад.ПродолжительностьРазгрузки) КАК ДатаВремяРазгрузкиПланКонец,
	|	ДОБАВИТЬКДАТЕ(ГрафикПоставокНаСклад.ДатаВремяПриездаФакт, МИНУТА, ГрафикПоставокНаСклад.ПродолжительностьРазгрузки) КАК ДатаВремяЗагрузкиФактКонец,
	|	втПотокиТранспортныхСредств.Секция КАК Секция,
	|	втПотокиТранспортныхСредств.Склад КАК Склад,
	|	ГрафикПоставокНаСклад.ТекстПоставки КАК ТекстПоставки,
	|	ГрафикПоставокНаСклад.СогласованоСоСкладом КАК СогласованоСоСкладом
	|ПОМЕСТИТЬ втЗаказыИОборудование
	|ИЗ
	|	втПотокиТранспортныхСредств КАК втПотокиТранспортныхСредств
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикПоставокНаСклад.СрезПоследних(, ) КАК ГрафикПоставокНаСклад
	|		ПО втПотокиТранспортныхСредств.Поток = ГрафикПоставокНаСклад.Поток
	|ГДЕ
	|	ГрафикПоставокНаСклад.ДатаВремяРазгрузкиПлан МЕЖДУ &ДатаВремяНачала И &ДатаВремяКонец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(втЗаказыИОборудование.Период) КАК Период,
	|	втЗаказыИОборудование.ЗаказПоставщику КАК ЗаказПоставщику,
	|	втЗаказыИОборудование.Поток КАК Поток,
	|	втЗаказыИОборудование.ДатаВремяРазгрузкиПлан КАК ДатаВремяРазгрузкиПлан,
	|	втЗаказыИОборудование.ПродолжительностьРазагрузки КАК ПродолжительностьРазагрузки,
	|	втЗаказыИОборудование.ДатаВремяПриездаФакт КАК ДатаВремяПриездаФакт,
	|	СУММА(втЗаказыИОборудование.КоличествоИспользуется) КАК КоличествоИспользуется,
	|	втЗаказыИОборудование.ДатаВремяРазгрузкиПланКонец КАК ДатаВремяРазгрузкиПланКонец,
	|	втЗаказыИОборудование.ДатаВремяЗагрузкиФактКонец КАК ДатаВремяЗагрузкиФактКонец,
	|	втЗаказыИОборудование.ЗаказПоставщику.Норматив КАК ЗаказПоставщикуНорматив,
	|	втЗаказыИОборудование.ЗаказПоставщику.Номер КАК ЗаказПоставщикуНомер,
	|	втЗаказыИОборудование.ТекстПоставки КАК ТекстПоставки,
	|	втЗаказыИОборудование.СогласованоСоСкладом КАК СогласованоСоСкладом,
	|	ЕСТЬNULL(СостояниеОтгрузкиДокументаСрезПоследних.Состояние, """") КАК Состояние
	|ИЗ
	|	втЗаказыИОборудование КАК втЗаказыИОборудование
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеОтгрузкиДокумента.СрезПоследних(
	|				,
	|				Документ В
	|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|							втЗаказыИОборудование.ЗаказПоставщику КАК ЗаказПоставщику
	|						ИЗ
	|							втЗаказыИОборудование КАК втЗаказыИОборудование)
	|					И Состояние В (&СтатусыДоставки)) КАК СостояниеОтгрузкиДокументаСрезПоследних
	|		ПО втЗаказыИОборудование.ЗаказПоставщику = СостояниеОтгрузкиДокументаСрезПоследних.Документ
	|
	|СГРУППИРОВАТЬ ПО
	|	втЗаказыИОборудование.ЗаказПоставщику,
	|	втЗаказыИОборудование.Поток,
	|	втЗаказыИОборудование.ДатаВремяРазгрузкиПлан,
	|	втЗаказыИОборудование.ПродолжительностьРазагрузки,
	|	втЗаказыИОборудование.ДатаВремяПриездаФакт,
	|	втЗаказыИОборудование.ДатаВремяРазгрузкиПланКонец,
	|	втЗаказыИОборудование.ДатаВремяЗагрузкиФактКонец,
	|	втЗаказыИОборудование.ТекстПоставки,
	|	втЗаказыИОборудование.ЗаказПоставщику.Норматив,
	|	втЗаказыИОборудование.ЗаказПоставщику.Номер,
	|	втЗаказыИОборудование.СогласованоСоСкладом,
	|	ЕСТЬNULL(СостояниеОтгрузкиДокументаСрезПоследних.Состояние, """")
	|
	|УПОРЯДОЧИТЬ ПО
	|	втЗаказыИОборудование.Поток.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТехническиеРесурсыСкладов.ДопустимоеКоличество - втЗаказыИОборудование.КоличествоИспользуется КАК ДоступныйОстаток,
	|	втЗаказыИОборудование.Оборудование КАК ТехСредство
	|ИЗ
	|	втЗаказыИОборудование КАК втЗаказыИОборудование
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТехническиеРесурсыСкладов КАК ТехническиеРесурсыСкладов
	|		ПО втЗаказыИОборудование.Склад = ТехническиеРесурсыСкладов.Склад
	|			И втЗаказыИОборудование.Оборудование = ТехническиеРесурсыСкладов.Оборудование
	|ГДЕ
	|	втЗаказыИОборудование.ЗаказПоставщику <> &ТекущийЗаказПоставщику";
	Запрос.УстановитьПараметр("ДатаВремяКонец", Период.ДатаОкончания);
	Запрос.УстановитьПараметр("ДатаВремяНачала", Период.ДатаНачала);
	Запрос.УстановитьПараметр("Секции", Секции.ВыгрузитьЗначения());
	Запрос.УстановитьПараметр("ТекущийЗаказПоставщику", ТекущийЗаказ);
	СтатусыДоставки = Новый Массив;
	СтатусыДоставки.Добавить(Перечисления.СостоянияОтгрузкиДокумента.Заехал);
	СтатусыДоставки.Добавить(Перечисления.СостоянияОтгрузкиДокумента.Выехал);
	Запрос.УстановитьПараметр("СтатусыДоставки", СтатусыДоставки);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ВыборкаДетальныеЗаписи = РезультатЗапроса[2].Выбрать();
	 
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СоответствиеЗначений = Новый Соответствие;
		СоответствиеЗначений.Вставить("Потоки", ВыборкаДетальныеЗаписи.Поток);
		//
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДатаВремяРазгрузкиПлан) И ВыборкаДетальныеЗаписи.ДатаВремяРазгрузкиПлан <> НачалоДня(ВыборкаДетальныеЗаписи.ДатаВремяРазгрузкиПлан) Тогда
			Поставка = ДанныеТаблицы.Добавить(ВыборкаДетальныеЗаписи.ДатаВремяРазгрузкиПлан, ВыборкаДетальныеЗаписи.ДатаВремяРазгрузкиПланКонец);
			Поставка.ЗначенияИзмерений = Новый ФиксированноеСоответствие(СоответствиеЗначений);
			Поставка.Текст = Строка(ВыборкаДетальныеЗаписи.ЗаказПоставщику.Контрагент) + ", " + Строка(ВыборкаДетальныеЗаписи.ЗаказПоставщикуНорматив) +", Заказ №" + Строка(ВыборкаДетальныеЗаписи.ЗаказПоставщикуНомер) +"; "+ Строка(ВыборкаДетальныеЗаписи.ТекстПоставки);//Строка(ВыборкаДетальныеЗаписи.ЗаказПоставщику) + ТекстБлока;
			Поставка.Значение = ВыборкаДетальныеЗаписи.ЗаказПоставщику;
			
			//цветовая индикация
			Если ВыборкаДетальныеЗаписи.Состояние = Перечисления.СостоянияОтгрузкиДокумента.Заехал Тогда
				Поставка.ЦветФона = WebЦвета.Золотой;
			ИначеЕсли  ВыборкаДетальныеЗаписи.Состояние = Перечисления.СостоянияОтгрузкиДокумента.Выехал Тогда 
				Поставка.ЦветФона = WebЦвета.ТусклоОливковый;
			ИначеЕсли ВыборкаДетальныеЗаписи.ДатаВремяПриездаФакт > ВыборкаДетальныеЗаписи.ДатаВремяРазгрузкиПлан Тогда
				Поставка.ЦветФона = WebЦвета.Лосось;
			ИначеЕсли ВыборкаДетальныеЗаписи.ДатаВремяПриездаФакт <> '00010101' Тогда
				Поставка.ЦветФона = WebЦвета.СветлоКоричневый;
			ИначеЕсли ВыборкаДетальныеЗаписи.ДатаВремяПриездаФакт = '00010101' И ВыборкаДетальныеЗаписи.ЗаказПоставщику <> ТекущийЗаказ Тогда
				Поставка.ЦветФона = WebЦвета.ЗеленыйЛес;		
			ИначеЕсли ВыборкаДетальныеЗаписи.ДатаВремяПриездаФакт = '00010101' И Не ЗаказЕстьВСетке И РежимРедактирования Тогда
				Поставка.ЦветФона = WebЦвета.Голубой;
				ЗаказЕстьВСетке = Истина;
			КонецЕсли;
				
			//согласованность
			Если НЕ ВыборкаДетальныеЗаписи.СогласованоСоСкладом Тогда
				Поставка.ЦветРамки = WebЦвета.ТемноБордовый;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если НачалоДня(Период.ДатаНачала) <> НачалоДня(Период.ДатаОкончания) Тогда
	Иначе
		ФормированиеЗакрытыхИнтерваловПоРесурсам();	
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура ЗаписатьИзмененияПланировщикаСервер(СогласованныйЗаказ=Неопределено)

	Если ИзмененныеЗаказы.Количество()=1 Тогда
		СтрЗаказа = ИзмененныеЗаказы[0];
		ИзменяемыеПараметры = Новый Структура;
		ИзменяемыеПараметры.Вставить("Поток");
		ИзменяемыеПараметры.Вставить("ДатаВремяРазгрузкиПлан");
		ИзменяемыеПараметры.Вставить("ПродолжительностьРазгрузки");
		ИзменяемыеПараметры.Вставить("СогласованоСоСкладом");
		
		ПоставкаСегодня = НачалоДня(СтрЗаказа.ДатаВремяРазгрузкиПлан) = НачалоДня(ТекущаяДата()); 
		ПоставкаЗавтраВечером =  НачалоДня(СтрЗаказа.ДатаВремяРазгрузкиПлан) = (НачалоДня(ТекущаяДата())+86400) 
										и ТекущаяДата() > (НачалоДня(ТекущаяДата())+57600);  //57600=16:00
		Если ПоставкаСегодня или ПоставкаЗавтраВечером Тогда
			СтрЗаказа.СогласованоСоСкладом = Ложь;
		КонецЕсли; 		
		ЗаполнитьЗначенияСвойств(ИзменяемыеПараметры, СтрЗаказа);
		
		Альтерра_СеткаПоставок.ИзменитьДанныеСеткиПоставок(СтрЗаказа.ЗаказПоставщику, "Редактирование",   ИзменяемыеПараметры);
	КонецЕсли;
КонецПроцедуры 

&НаСервере
Функция ЕстьЛиДоступноеОборудование(НачалоИнтервала, ДлительностьИнтервала, Заказ, ВремяНачала, ВремяКонца)
	Если ДополнительныеРесурсы.Количество()>0  Тогда
		 Возврат НЕ ПопалиВЗакрытыйИнтервал(НачалоИнтервала, ДлительностьИнтервала, Заказ, ВремяНачала, ВремяКонца);
	КонецЕсли;
	Возврат Истина;
КонецФункции 

&НаСервере
Функция ПопалиВЗакрытыйИнтервал(НачалоИнтервала, КонецИнтервала, Заказ, ВремяНачала, ВремяКонца)	
	ИнтервалыФонаРозовые = Планировщик.ИнтервалыФона;
	Для каждого ЗакрытыйИнтервал из ИнтервалыФонаРозовые Цикл
		Если ЗакрытыйИнтервал.Цвет = WebЦвета.Розовый Тогда
			Если ПроверкиАльтерраСервер.ИнтервалПопалВПромежуток(ЗакрытыйИнтервал.Начало, ЗакрытыйИнтервал.Конец, НачалоИнтервала, КонецИнтервала) И ПроверкиАльтерраСервер.ИнтервалПопалВПромежуток(ВремяНачала, ВремяКонца, ЗакрытыйИнтервал.Начало, ЗакрытыйИнтервал.Конец) Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;
КонецФункции 

&НаСервере
Функция ПолучитьТаблицуИнтерваловЗанятогоПоСкладуОборудования(НачалоПериода, КонецПериода, Заказ)
	  ТабИнтервалов = Новый ТаблицаЗначений;
	  Запрос = Новый Запрос;
	  Запрос.Текст = 
	  "ВЫБРАТЬ
	  |	ТЧ.Ресурс КАК Оборудование,
	  |	ТЧ.ТребуемоеКоличество КАК ТребуемоеКоличество
	  |ПОМЕСТИТЬ втРесурсыДокумента
	  |ИЗ
	  |	&ТЧ КАК ТЧ
	  |;
	  |
	  |////////////////////////////////////////////////////////////////////////////////
	  |ВЫБРАТЬ
	  |	ГрафикПоставокНаСкладСрезПоследних.ДатаВремяРазгрузкиПлан КАК НачалоИнтервала,
	  |	ДОБАВИТЬКДАТЕ(ГрафикПоставокНаСкладСрезПоследних.ДатаВремяРазгрузкиПлан, МИНУТА, ГрафикПоставокНаСкладСрезПоследних.ПродолжительностьРазгрузки) КАК КонецИнтервала,
	  |	isnull(ГрафикПоставокНаСкладСрезПоследних.КоличествоИспользуется,0) КАК КоличествоИспользуется,
	  |	ГрафикПоставокНаСкладСрезПоследних.Оборудование КАК Оборудование,
	  |	isnull(ТехническиеРесурсыСкладов.ДопустимоеКоличество,0) КАК ДопустимоеКоличество,
	  |	isnull(втРесурсыДокумента.ТребуемоеКоличество,0) КАК ТребуемоеКоличество
	  |ИЗ
	  |	РегистрСведений.ГрафикПоставокНаСклад.СрезПоследних(
	  |			&Период,
	  |			Оборудование В (&СписокРесурсов)
	  |				И ЗаказПоставщику.Склад = &Склад
	  |				И (ДатаВремяРазгрузкиПлан МЕЖДУ &НачалоПериода И &КонецПериода)
	  |				И ПродолжительностьРазгрузки > 0) КАК ГрафикПоставокНаСкладСрезПоследних
	  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТехническиеРесурсыСкладов КАК ТехническиеРесурсыСкладов
	  |		ПО ГрафикПоставокНаСкладСрезПоследних.ЗаказПоставщику.Склад = ТехническиеРесурсыСкладов.Склад
	  |			И ГрафикПоставокНаСкладСрезПоследних.Оборудование = ТехническиеРесурсыСкладов.Оборудование
	  |		ЛЕВОЕ СОЕДИНЕНИЕ втРесурсыДокумента КАК втРесурсыДокумента
	  |		ПО ГрафикПоставокНаСкладСрезПоследних.Оборудование = втРесурсыДокумента.Оборудование
	  |ГДЕ
	  |	ГрафикПоставокНаСкладСрезПоследних.ЗаказПоставщику <> &ЗаказПоставщику
	  |
	  |УПОРЯДОЧИТЬ ПО
	  |	НачалоИнтервала,
	  |	КонецИнтервала
	  |ИТОГИ
	  |	СУММА(КоличествоИспользуется),
	  |	МАКСИМУМ(ДопустимоеКоличество),
	  |	МАКСИМУМ(ТребуемоеКоличество)
	  |ПО
	  |	Оборудование";
	  Запрос.УстановитьПараметр("Период", КонецДня(ТекущаяДата()));
	  Запрос.УстановитьПараметр("ТЧ", ДополнительныеРесурсы.Выгрузить());
	  Запрос.УстановитьПараметр("СписокРесурсов", ДополнительныеРесурсы.Выгрузить(,"Ресурс"));
	  Запрос.УстановитьПараметр("Склад", Заказ.Склад);
	  Запрос.УстановитьПараметр("ЗаказПоставщику", Заказ);
	  Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	  Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	  Результат = Запрос.Выполнить();
	  СтруктураРезультатаЗапроса = Новый Структура;
	  СтруктураРезультатаЗапроса.Вставить("Результат", Результат);
	  Возврат СтруктураРезультатаЗапроса;
КонецФункции 

&НаСервере
Процедура ФормированиеЗакрытыхИнтерваловПоРесурсам()
	ИзмеренияИнтервалов = Планировщик.Измерения[0].Элементы;
	МассивСоответствий = Новый Массив;
	Для каждого Измерение из  ИзмеренияИнтервалов Цикл
		СоответствиеЗначений = Новый Соответствие;
		СоответствиеЗначений.Вставить("Потоки", Измерение.Значение);
		ФиксированноеСоответствие = Новый ФиксированноеСоответствие(СоответствиеЗначений);
		МассивСоответствий.Добавить(ФиксированноеСоответствие);
	КонецЦикла;
	
	//формируем неупорядоченную таблицу занятых интервалов
	
	//проверка на ресурсы -------
	РезультатЗапросаПоРесурсам = ПолучитьТаблицуИнтерваловЗанятогоПоСкладуОборудования(Период.ДатаНачала, Период.ДатаОкончания, ТекущийЗаказ).Результат; 
	Если РезультатЗапросаПоРесурсам<>Неопределено Тогда
		ВыборкаОборудование = РезультатЗапросаПоРесурсам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Оборудование");
		//к занятым интервалам добавляем занятые по складу интервалы
		ПредыдущийИнтервал =Неопределено; 				
		ТребуемоеКоличество = 0;
		ДопустимоеКоличество = 0;
		НачалоИнтервала = Период.ДатаНачала;
		КонецИнтервала = Период.ДатаОкончания;
		КоличествоИспользуется = 0;
		Пока ВыборкаОборудование.Следующий() Цикл			
			ВыборкаДеталиОборудование = ВыборкаОборудование.Выбрать();
			ТребуемоеКоличество = ВыборкаОборудование.ТребуемоеКоличество;
			 ДопустимоеКоличество = ВыборкаОборудование.ДопустимоеКоличество; 
			Пока ВыборкаДеталиОборудование.Следующий() Цикл 
				НачалоИнтервала = ВыборкаДеталиОборудование.НачалоИнтервала;
				КонецИнтервала = ВыборкаДеталиОборудование.КонецИнтервала;
				КоличествоИспользуется = ВыборкаДеталиОборудование.КоличествоИспользуется;
				Если ПредыдущийИнтервал = Неопределено Тогда
					ПредыдущийИнтервал = Новый Структура;
					ПредыдущийИнтервал.Вставить("Начало", ВыборкаДеталиОборудование.НачалоИнтервала);
					ПредыдущийИнтервал.Вставить("Конец", ВыборкаДеталиОборудование.КонецИнтервала);
					ПредыдущийИнтервал.Вставить("Количество", ВыборкаДеталиОборудование.КоличествоИспользуется);
				Иначе
					ВыявитьИнтервалыБлокировкиОборудования(ТребуемоеКоличество, ДопустимоеКоличество, ПредыдущийИнтервал, НачалоИнтервала, КонецИнтервала, КоличествоИспользуется, МассивСоответствий);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		Если ВыборкаОборудование.Количество() > 0 Тогда
			ВыявитьИнтервалыБлокировкиОборудования(ТребуемоеКоличество, ДопустимоеКоличество, ПредыдущийИнтервал, НачалоИнтервала, КонецИнтервала, КоличествоИспользуется, МассивСоответствий);
		КонецЕсли;
	КонецЕсли;
	// ------- проверка на ресурсы

КонецПроцедуры 

&НаСервере
Процедура ВыявитьИнтервалыБлокировкиОборудования(ТребуемоеКоличество, ДопустимоеКоличество, ПредыдущийИнтервал, НачалоИнтервала, КонецИнтервала, КоличествоИспользуется, МассивСоответствий)
	
	ИнтервалыФона = Планировщик.ИнтервалыФона;
	//вносим интервал в таблицу
	//ТребуемоеКоличество = ВыборкаОборудование.ТребуемоеКоличество;
	//2 ситуации:
	Если ПредыдущийИнтервал.Начало < НачалоИнтервала И ПредыдущийИнтервал.Конец < КонецИнтервала Тогда   
		//предыдущий интервал и текущий не пересекаются
		//если количество по предыдущему интервалу позволяет задействовать ещё один ресурс, то интервал считается свободным и не вносится в таблицу
		//иначе интервал вносится в заблокированные
		Если (ДопустимоеКоличество - ПредыдущийИнтервал.Количество - ТребуемоеКоличество) < 0 Тогда
			ЗакраситьИнтервалФона(МассивСоответствий, WebЦвета.Розовый, ПредыдущийИнтервал.Начало, ПредыдущийИнтервал.Конец, ИнтервалыФона);
		КонецЕсли;
		ПредыдущийИнтервал = Новый Структура;
		ПредыдущийИнтервал.Вставить("Начало", НачалоИнтервала);
		ПредыдущийИнтервал.Вставить("Конец", КонецИнтервала);
		ПредыдущийИнтервал.Вставить("Количество", КоличествоИспользуется);
	Иначе
		//предыдущий интервал пересекает текущий
		//любое пересечение разбивает два интервала на 2-3 подинтервала. Необходимо рассматривать их как отдельные интервалы 
		
		//Первый подинтервал
		НачалоПервогоИнтервала = ПредыдущийИнтервал.Начало; //т.к. у нас шло упорядочевание по возрастанию даты начала, а затем даты конца, то минимальное значение будет таким
		Если  НачалоПервогоИнтервала <> НачалоИнтервала Тогда 
			КонецПервогоИнтервала = Мин(НачалоИнтервала, ПредыдущийИнтервал.Конец);
		Иначе
			КонецПервогоИнтервала = Мин(КонецИнтервала, ПредыдущийИнтервал.Конец);
		КонецЕсли;
		
		//определяем степень пересечения
		Если НачалоПервогоИнтервала = НачалоИнтервала Тогда
			КоличествоВПервомИнтервале = ПредыдущийИнтервал.Количество + КоличествоИспользуется;
		Иначе
			КоличествоВПервомИнтервале = ПредыдущийИнтервал.Количество;
		КонецЕсли;
		
		Если  (ДопустимоеКоличество - КоличествоВПервомИнтервале - ТребуемоеКоличество) < 0 Тогда
			ЗакраситьИнтервалФона(МассивСоответствий, WebЦвета.Розовый, НачалоПервогоИнтервала, КонецПервогоИнтервала, ИнтервалыФона); 
		КонецЕсли;
		
		//Второй подинтервал
		НачалоВторогоИнтервала = КонецПервогоИнтервала;
		КонецВторогоИнтервала = Мин(ПредыдущийИнтервал.Конец, КонецИнтервала);
		Если НачалоВторогоИнтервала = КонецИнтервала Тогда
			КоличествоВоВторомИнтервале = ПредыдущийИнтервал.Количество; 
		Иначе
			КоличествоВоВторомИнтервале = ПредыдущийИнтервал.Количество + КоличествоИспользуется;
		КонецЕсли;
		
		Если  (ДопустимоеКоличество - КоличествоВоВторомИнтервале - ТребуемоеКоличество) < 0 Тогда
			ЗакраситьИнтервалФона(МассивСоответствий, WebЦвета.Розовый, НачалоВторогоИнтервала, КонецВторогоИнтервала, ИнтервалыФона); 
		КонецЕсли;
		
		//Третий подинтервал (которого может и не быть)
		Если  НачалоВторогоИнтервала <> КонецИнтервала Тогда
			НачалоТретьегоИнтервала = КонецВторогоИнтервала; 
			КонецТретьегоИнтервала = Макс(ПредыдущийИнтервал.Конец, КонецИнтервала);
			Если КонецВторогоИнтервала = КонецИнтервала Тогда
				КоличествоВТретьемИнтервале = ПредыдущийИнтервал.Количество;
			Иначе
				КоличествоВТретьемИнтервале = КоличествоИспользуется;
			КонецЕсли;
			
			Если  (ДопустимоеКоличество - КоличествоВТретьемИнтервале - ТребуемоеКоличество) < 0 Тогда
				ЗакраситьИнтервалФона(МассивСоответствий, WebЦвета.Розовый, НачалоТретьегоИнтервала, КонецТретьегоИнтервала, ИнтервалыФона); 
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура ЗакраситьИнтервалФона(Знач СтруктураСоответствий, Знач Цвет, Знач НачалоИнтервала, Знач КонецИнтервала, ИнтервалыФона)
	Если ТипЗнч(СтруктураСоответствий)=Тип("Массив") Тогда
		МассивСоответствий = СтруктураСоответствий;
		Для каждого Соответствие из МассивСоответствий Цикл
			ЗакрытыйИнтервал = ИнтервалыФона.Добавить(НачалоИнтервала,  КонецИнтервала);
			ЗакрытыйИнтервал.Цвет = Цвет;
			ЗакрытыйИнтервал.ЗначенияИзмерений = Соответствие;
		КонецЦикла;
	Иначе
		Соответствие = СтруктураСоответствий;
		ЗакрытыйИнтервал = ИнтервалыФона.Добавить(НачалоИнтервала,  КонецИнтервала);
		ЗакрытыйИнтервал.Цвет = Цвет;
		ЗакрытыйИнтервал.ЗначенияИзмерений = Соответствие;
	КонецЕсли;
КонецПроцедуры 

&НаСервере
Процедура ЗаписатьДанныеПоставки(Заказ, Поток)
	ДокументОбъект = Заказ.ПолучитьОбъект();
	Если ВремяНачалаПоставки = '00010101' Тогда
		ВремяНачалаПоставки = Период.ДатаНачала;
	КонецЕсли;
	ДокументОбъект.ЗаписатьИнтервалДоставки(Поток, ПродолжительностьРазгрузки, ВремяНачалаПоставки, ДополнительныеРесурсы, КомментарийКПоставке, ЗначениеСогласованияСоСкладом);
КонецПроцедуры 

&НаСервере
Функция ПолучитьКомментарийПоставки(ЗаказПоставщику)	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГрафикПоставокНаСкладСрезПоследних.ТекстПоставки КАК ТекстПоставки
		|ИЗ
		|	РегистрСведений.ГрафикПоставокНаСклад.СрезПоследних(, ЗаказПоставщику = &ЗаказПоставщику) КАК ГрафикПоставокНаСкладСрезПоследних";
	Запрос.УстановитьПараметр("ЗаказПоставщику", ЗаказПоставщику);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.ТекстПоставки;
	КонецЕсли;

Возврат "";	

КонецФункции 

&НаСервере
Функция ПолучитьПолныйТекстКомментария(ЗаказПоставщику, НовыйКомментарий="")
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	ТекстКПоставке = ПолучитьКомментарийПоставки(ЗаказПоставщику);
	НовыйКомментарий = ?(НовыйКомментарий="", ТекстКПоставке, НовыйКомментарий);
	Если ТекстКПоставке<>НовыйКомментарий Тогда
		ИзменяемыеПараметры = Новый Структура;
		ИзменяемыеПараметры.Вставить("ТекстПоставки", НовыйКомментарий);
		Альтерра_СеткаПоставок.ИзменитьДанныеСеткиПоставок(ЗаказПоставщику, "Редактирование",  ИзменяемыеПараметры);
		ТекстКПоставке = НовыйКомментарий;
	КонецЕсли;
	
	Текст = Строка(ЗаказПоставщику.Контрагент) + ", " + Строка(ЗаказПоставщику.Норматив) +", Заказ №" + Строка(ЗаказПоставщику.Номер) +"; "+ ТекстКПоставке; 

	Возврат Текст;
КонецФункции 

#КонецОбласти
